/*Начинающий математик Ксения учится в третьем классе. 
Сейчас в школе она проходит операцию сложения.

Учитель записал на доске сумму нескольких чисел, которую требуется посчитать. 
Чтобы было проще считать, в сумме используются только числа 1, 2 и 3. Но и этого Ксении мало. 
Ксения только учится считать, и поэтому она может посчитать сумму, только если слагаемые в сумме 
идут в порядке неубывания. Например, сумму 1+3+2+1 она посчитать не может, а суммы 1+1+2 и 3+3 может.

Вам задана сумма, которая записана на доске. Переставьте слагаемые и выведите ее в виде, 
в котором Ксения сможет посчитать сумму.

Входные данные
В первой строке записана непустая строка s — сумма, которую нужно посчитать Ксении. 
Строка s не содержит пробелов, состоит только из цифр и знаков «+» и является корректной суммой 
чисел 1, 2 и 3. Длина строки s не более 100 символов.

Выходные данные
Выведите новую сумму, которую сможет посчитать Ксения.*/
#include <stdio.h>
#define MAX 1000
int main() {
    int a[MAX];
    int len=0;
    
    if(scanf("%d", &a[len])==1){
        len++;
        while(scanf("+%d", &a[len])==1){
            len++;
        }
    }
    for(int i=0; i<len; i++){
        for(int j=i+1; j<len; j++){
            if(a[i]>a[j]){
                int temp=a[i];
                a[i]=a[j];
                a[j]=temp;
            }
        }
    }
    for(int i=0; i<len; i++){
        if(i!=len-1)
        printf("%d+", a[i]);
        else
        printf("%d", a[i]);
    }
}
